app/Controllers/Home.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Jumlah wilayah
        $jumlahwilayah = $db->table('wilayah')->countAll();

        // Total penduduk
        $row = $db->table('wilayah')
            ->selectSum('jumlah_penduduk')
            ->get()
            ->getRow();

        $totalPenduduk = $row ? $row->jumlah_penduduk : 0;

        // Data wilayah untuk tabel
        $wilayah = $db->table('wilayah')->get()->getResult();
---
SELECT COUNT(*) AS `numrows` FROM `wilayah`
SELECT SUM(`jumlah_penduduk`) AS `jumlah_penduduk`
FROM `wilayah`
SELECT *
FROM `wilayah`